## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keyvault.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "kv-aztf-log-prod-ne-03"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "rg-aztf-logging-prod-ne-01"
      + sku_name                        = "premium"
      + soft_delete_retention_days      = 90
      + tenant_id                       = "48c383d8-47c5-48f9-9e8b-afe4f2519054"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "None"
          + default_action = "Deny"
        }
    }

  # module.keyvault.azurerm_resource_group_template_deployment.telemetry[0] will be created
  + resource "azurerm_resource_group_template_deployment" "telemetry" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = (known after apply)
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg-aztf-logging-prod-ne-01"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + outputs        = {
                  + telemetry = {
                      + type  = "String"
                      + value = "Azure Verified Modules. For more information, see https://aka.ms/avm/telemetryinfo"
                    }
                }
              + parameters     = {}
              + resources      = []
              + variables      = {}
            }
        )
    }

  # module.keyvault.random_id.telemetry[0] will be created
  + resource "random_id" "telemetry" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.keyvault.time_sleep.wait_for_rbac_before_key_operations[0] will be created
  + resource "time_sleep" "wait_for_rbac_before_key_operations" {
      + create_duration  = "30s"
      + destroy_duration = "0s"
      + id               = (known after apply)
      + triggers         = {
          + "role_assignments" = jsonencode({})
        }
    }

  # module.keyvault.time_sleep.wait_for_rbac_before_secret_operations[0] will be created
  + resource "time_sleep" "wait_for_rbac_before_secret_operations" {
      + create_duration  = "30s"
      + destroy_duration = "0s"
      + id               = (known after apply)
      + triggers         = {
          + "role_assignments" = jsonencode({})
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>